Revit 2024 API
ImageType.HeightInPixels Property
 Number of pixels in the vertical direction of the image
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public int HeightInPixels { get; }
Visual Basic
Public ReadOnly Property HeightInPixels As Integer
	Get
Visual C++
public:
property int HeightInPixels {
	int get ();
}
See Also
ImageType Class
Autodesk.Revit.DB Namespace